{
    "mit": {
        "name": "Media and IT",
        "logo": "mit.png",
        "image": "mit.png",
        "intro": "Covers technical activities including videography, photography, projection and publicity.",
        "text": "A ministry that takes part in live coverage of the church services through projection, videography and photography. It is also responsible for the publicity of church events through posters and direct SMS. Through selected individuals it also manages the social media platforms of the Union and the Union's websites. Leadership: a Director, 3 Assistant Directors and 7 heads in charge of various dockets. Our Motto: We got you covered."
    },
    "praise": {
        "name": "Praise and Worship",
        "logo": "pw.jpg",
        "image": "pw.jpg",
        "intro": "We are called to serve using our voices, leading in praise and worship. Praise and worship is a ministry where we sing our praises and worship to God",
        "text": "We lead the church in songs to praise and worship our God... Our family consists of about 60-70 active members. We also have a sub committee that has several members... We have the prayer docket that has several members (10) who pray for the family, and organize prayer meetings. We have the specialized committee that has five members who act as the hospitality team of the family. They also help to choose dresscodes for us.  They are coordinated by the assistant Director. We meet on Tuesdays for our fellowships as from 6:00-8:00pm, on Fridays for prayers and practices as from 6:00-7:00pm. We also meet on Saturdays for practices as from 1:00-4:00pm and on sunday mornings for prayers as from 6:15 am. We usually have prayer retreats and bondings and hikes as planned by the leadersour family is a family of love... A family where everybody is somebody"
    },
    "creative": {
        "name": "Creative",
        "logo": "creative.jpg",
        "image": "creative.jpg",
        "intro": "We explore the word of God, delivering our talents through arts and entertainment.",
        "text": ""
    },
    "hospitality": {
        "name": "Hospitality",
        "logo": "hospi.png",
        "image": "hospi.png",
        "intro": "Cordinates members welfare, catering and ushering as well as nurturing into responsible adults.",
        "text": "Hospitality ministry has three dockets in it. Ushering docket, catering docket and welfare docket. In ushering docket, we have one director and two assistant directors who help in overseeing the activities of the docket. The docket deals with arranging the church in time, keeping order in the church and collecting offering. The director ushering is also in charge of the ministry's treasury. Catering docket also is led by one director and two assistant directors. They are in charge of preparing meals during CU events, preparing meals for the speaker on Friday evenings and Sunday mornings and noon times. They are also in charge of cleaning the speaker's house. The directors main work is to mobilize members to participate in the ministry's activities like arranging the hall and preparing meals. The welfare committee is made up of eleven members; two first year representatives, two second year representatives, two third year representatives, two fourth year representatives, executive representative that is the CU hospitality director, secretary and the chairperson. This docket is always active during the last three weeks of the semester to help CU students who run bankrupt towards the end of the semester. It's funded by the CU. The welfare committee members are not necessarily members of the hospitality ministry and they are changed every semester. Hospitality ministry also has a discipleship coordinator who encourages members to be accountable for each other. There is also a prayer coordinator who helps in coordinating the prayer life of the ministry. There is also a secretary who writes minutes during our meetings, takes attendance roll of members during our fellowships and prayers and communicates to members informing them about the time and venue of our fellowships and prayers and reminding them to avail themselves during the same. During the prayer and fasting we encourage members to contribute the amount that they would have used that day to fund the ministry's activities. This amount is given to director in charge of ushering who is also in charge of the treasury. As a ministry we work together despite having different dockets. We usually meet on Tuesday evening from 6-7 to conclude our prayers and fasting, on Saturdays from 4-6 pm for our fellowship, Friday and Sunday 30 minutes before the service to share duties and also pray as the ministry."
    },
    "high-school": {
        "name": "High School",
        "logo": "",
        "image": "",
        "intro": "We want to help middle school and high school students thrive in  their spiritual journey.",
        "text": ""
    },
    "instrumentalist": {
        "name": "Instrumentalist",
        "logo": "",
        "image": "",
        "intro": "Participation through gospel music, training and setting up of Instrument",
        "text": " This is the Instrumentalist family, one of the four Board Ministries of the Maseno University Christian Union. Everyone and anyone is a legible member of this family since it goes far beyond the playing of instruments considering the fact that ultimately we are in ministries to serve God in whichever way possible. We can proudly say it is the only ministry that links directly to every other ministry in the Christian Union.Transportation and Setting up of instruments for Friday and Sunday fellowships, in-reach and outreach crusades and any other CU activity that requires a public address system. Ministrations using musical    instruments together with the praise and worship, choir and creative ministries, to add onto that, joint ministration as Board ministry. Custodians of all the instruments, including those of the evangelistic teams and any ministry that has the same. The main objective is to make sure that in everything we do, we do it all for the glory of God, it is Him that we are serving. Enhancement of skills in ministers who have interest or are playing any instrument through training and practice sessions.We also provide, most importantly, the platform for spiritual growth through the word, prayer, fellowships and service in pursuit of the goals and visions of the Christian Union. Not only that but also in leadership through the various dockets that we have and socially when participating in the ministry’s activities. It is our quest to raise all-round Christians. Prayer and fasting day where we usually meet from 1-2pm for lunchtime prayers outside lecture hall 14. Fellowships (6-8pm) in millennium hall 3. We have a session of intercession and  hearing the word of God. SARTUDAYS: Trainings from (11-1 pm), practices as instrumentalists (1-2pm), after which we have a bible study session (2-3pm) and lastly practices with praise and worship and choir ministries." 
    },
    "sunday-school": {
        "name": "Sunday School",
        "logo": "",
        "image": "",
        "intro": "Teaching, Giving, Directing and Sharing Knowledge of Jesus Christ to Children.",
        "text": "Sunday school ministry is a ministry under the outreach docket. We majorly reach out to children in and outside Maseno Environs. Some of the places we reach out are ;Maseno Girls boarding schoolMaseno Educational Center, Wonderland, Ack Maseno, Mabungo, JCC in Otonglo, Kima Revival church and Chulaimbo and ACK. We usually do our missions each and every Sunday all for the glory of God. We usually have our fellowship once a week. Usually happens on Fridays from 5pm-6.30pm in M5. Some of the activities we engage in in a Semester are; organizing charity events to Children's home, hike, bonding, prayer retreats training sessions and many more."
    },
    "discipleship": {
        "name": "Discipleship",
        "logo": "",
        "image": "",
        "intro": "We spread the good news,teach the word and reaching souls through missions and evangelism, A ministry concerned with disciplining and people to understand salvation",
        "text": "The ministry is divided into three parts. Nurturring  which deals with nurturing new believers, Library which deals with the Cu library and keeps all the documents of the mother church ,the CDs, Guidance and counseling where the believers and other members of the church are being helped and guided on various issues affecting them. The ministry holds events like hikes, Bonding"
    },
    "intercessory": {
        "name": "Intercessory",
        "logo": "",
        "image": "",
        "intro": "We have fellowship through prayer presenting needs and petitions individually and the church as a whole.",
        "text": "Intercessory Ministry is a prayer ministry formed for the sake of making intercessions for the church. It comprises of all members who have registered through the CU who wish to be part holds and plans prayer meeting for the church. It overlooks the prayer meetings of the church on Wednesdays, Fridays, and Saturdays by appointing facilitators for the same. The intercessory ministry also undertakes the prayer week and prayer week and the prayer Kesha at the beginning of every semester We always have our prayer meetings on Friday and Sundays before the service and Our ministry Fellowship every Tuesday from 6:30 pm - 5.00 pm where We have a prayer and teaching section."
    }
}