{
    "mit": {
        "name": "Media and IT",
        "logo": "",
        "image": "",
        "intro": "Covers technical activities including videography, photography, projection and publicity.",
        "text": "A ministry that takes part in live coverage of the church services through projection, videography and photography. It is also responsible for the publicity of church events through posters and direct SMS. Through selected individuals it also manages the social media platforms of the Union and the Union's websites. Leadership: a Director, 3 Assistant Directors and 7 heads in charge of various dockets. Our Motto: We got you covered."
    },
    "praise": {
        "name": "Praise and Worship",
        "logo": "",
        "image": "",
        "intro": "We are called to serve using our voices, leading in praise and worship.",
        "text": ""
    },
    "creative": {
        "name": "Creative",
        "logo": "",
        "image": "",
        "intro": "We explore the word of God, delivering our talents through arts and entertainment.",
        "text": ""
    },
    "hospitality": {
        "name": "Hospitality",
        "logo": "",
        "image": "",
        "intro": "Cordinates members welfare, catering and ushering as well as nurturing into responsible adults.",
        "text": "Hospitality ministry has three dockets in it. Ushering docket, catering docket and welfare docket. In ushering docket, we have one director and two assistant directors who help in overseeing the activities of the docket. The docket deals with arranging the church in time, keeping order in the church and collecting offering. The director ushering is also in charge of the ministry's treasury. Catering docket also is led by one director and two assistant directors. They are in charge of preparing meals during CU events, preparing meals for the speaker on Friday evenings and Sunday mornings and noon times. They are also in charge of cleaning the speaker's house. The directors main work is to mobilize members to participate in the ministry's activities like arranging the hall and preparing meals. The welfare committee is made up of eleven members; two first year representatives, two second year representatives, two third year representatives, two fourth year representatives, executive representative that is the CU hospitality director, secretary and the chairperson. This docket is always active during the last three weeks of the semester to help CU students who run bankrupt towards the end of the semester. It's funded by the CU. The welfare committee members are not necessarily members of the hospitality ministry and they are changed every semester. Hospitality ministry also has a discipleship coordinator who encourages members to be accountable for each other. There is also a prayer coordinator who helps in coordinating the prayer life of the ministry. There is also a secretary who writes minutes during our meetings, takes attendance roll of members during our fellowships and prayers and communicates to members informing them about the time and venue of our fellowships and prayers and reminding them to avail themselves during the same. During the prayer and fasting we encourage members to contribute the amount that they would have used that day to fund the ministry's activities. This amount is given to director in charge of ushering who is also in charge of the treasury. As a ministry we work together despite having different dockets. We usually meet on Tuesday evening from 6-7 to conclude our prayers and fasting, on Saturdays from 4-6 pm for our fellowship, Friday and Sunday 30 minutes before the service to share duties and also pray as the ministry."
    },
    "high-school": {
        "name": "High School",
        "logo": "",
        "image": "",
        "intro": "We want to help middle school and high school students thrive in  their spiritual journey.",
        "text": ""
    },
    "instrumentalist": {
        "name": "Instrumentalist",
        "logo": "",
        "image": "",
        "intro": "Participation through gospel music, training and setting up of Instrument",
        "text": ""
    },
    "sunday-school": {
        "name": "Sunday School",
        "logo": "",
        "image": "",
        "intro": "Teaching, Giving, Directing and Sharing Knowledge of Jesus Christ to Children.",
        "text": ""
    },
    "discipleship": {
        "name": "Discipleship",
        "logo": "",
        "image": "",
        "intro": "We spread the good news,teach the word and reaching souls through missions and evangelism.",
        "text": ""
    },
    "intercessory": {
        "name": "Intercessory",
        "logo": "",
        "image": "",
        "intro": "We have fellowship through prayer presenting needs and petitions individually and the church as a whole.",
        "text": ""
    }
}